{
  "id": "downer-deploys-microsoft",
  "enabled": false,
  "title": "Downer deploys Microsoft AI solution to boost safety on Sydney trains",
  "author": "Samira Sarraf",
  "authorLink": "https://www.arnnet.com.au/author/2147449418/samira-sarraf/articles",
  "text": [
    "Downer Group has deployed a Microsoft Azure based solution to capture and store data from Sydney's fleet of Waratah trains and use advanced data analytics and visualisation tools to make sense of the information received. ",
    "Specifically, the solution allows Downer engineers to make data-driven decisions about train maintenance. ",
    "In 2017, Downer entered into a strategic alliance with Microsoft to co-cooperatively develop and market cloud-based solutions and services for specific industry sectors. Downer's Rollingstock services business is one of the first adopters of the Azure based solution",
    "With 24 trains ordered by the NSW Government in 2016 and another 17 in February, the data will come from the trains' over 300 sensors and 90 cameras. Every 10 minutes, 30,000 signals are sent from the train to Downer, which holds a 30-year contract with the NSW Government to manage and maintain the existing fleet of 78 trains. ",
    "This allows Downer to map out the risk of a failure, anticipate any maintenance required and schedule downtime required for that maintenance ahead of time. ",
    "'With such massive volumes of data it will allow us to establish trends in relative real time, allow us to predict failures in advance and calculate the remaining life of an asset more effectively,' said Tim Young executive general manager at Downer's Rollingstock Services, Transport and Infrastructure. ",
    "'The advantage to our customers is that all of this takes place whilst the train is in service without interrupting the operation and at the same time enhances worker safety through the potential of removing high risk inspections. "
  ],
  "imageName": "train.jpg",
  "originalSourceURL": "https://www.arnnet.com.au/article/660037/downer-deploys-microsoft-ai-solution-boost-safety-sydney-trains/",
  "publishedAgo": "2Days",
  "breakingNews": false,
  "newsLocation": "Australia",
  "source": "arnnet.com.au"
}