{
  "id": "gauff-halts-hercog",
  "title": "'It's pretty surreal how life changes': Gauff halts Hercog, sets Halep battle at Wimbledon",
  "author": "WTA Staff",
  "authorLink": "#",
  "text": [
    "Teenage sensation Coco Gauff fended off two match points to overcome Polona Hercog and keep her tremendous Wimbledon performance rolling into the second week, where she will take on Simona Halep.",
    "The outstanding Wimbledon run of 15-year-old American qualifier Cori \"Coco\" Gauff reached new heights on Centre Court on Friday, as the teenage sensation came back from a 6-3, 5-2 deficit and saved two match points in the process to overcome Slovenia's Polona Hercog, 3-6, 7-6(7), 7-5, and reach the fourth round of her maiden Grand Slam main draw.",
    "\"When [the last shot] was going overhead, I was like, 'Please go out, please,'\" Gauff said in her post-match press conference. \"Then after, when I was jumping, I was like, 'Wow, I can't believe it. It's been one long match, it's finally over!'\"",
    "Gauff, the youngest Wimbledon qualifier in the Open Era and the first 15-year-old to contest the main draw of the grass-court Grand Slam in a decade, dropped her first set in her three qualifying and three main-draw matches of the event, but steered her way back from the precipice to outlast World No.60 Hercog in two hours and 46 minutes of play.",
    "\"When I was walking on the court, I kind of wasn't nervous, but I was just like, 'Wow, I'm really on Centre Court, one of the most sacred courts in the world,'\" said Gauff. \"When I was down 5-2, I was just like, I can fight back. Just need to hold serve, break, then we'll see what happens from there.\"",
    "After dropping the first set, Gauff exhibited tremendous grit to pull out two challenging sets to get the win, and was more adept than her opponent at net during the match, winning 61 percent of points in the forecourt, to Hercog's 47 percent."
  ],
  "imageName": "gauff.jpg",
  "originalSourceURL": "https://www.wtatennis.com/news/its-pretty-surreal-how-life-changes-gauff-halts-hercog-sets-halep-battle-wimbledon",
  "publishedAgo": "1-5Days",
  "editorialHighlight": true,
  "hasVideo": true,
  "source": "wtatennis.com",
  "entities": {
    "highlightedPlayer": "CocoGauff",
    "location": "London",
    "tournament": "Wimbledon"
  },
  "tags": [
    "Wimbledon",
    "CocoGauff",
    "PolonaHercog"
  ]
}
